<a href="https://colab.research.google.com/github/Thirumalkshatriya/Sanjay-Practice/blob/master/SQL_studentanualReport.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
USE Student_db

Create table studentAnualReport

(
	RollNo int,
	StudentNames Varchar (100),
	Marks Float

)

SELECT * From studentAnualReport

INSERT INTO studentAnualReport Values
(1, 'Thirumal', 99),
(2, 'Kushi', 100),
(3, 'Naveen', 87),
(4, 'Srujan', 84)

update studentAnualReport
set StudentNames	= 'Gagana', Marks = 98
where RollNo = 4;

SELECT * FROM studentAnualReport

INSERT INTO studentAnualReport
(RollNo, StudentNames, Marks)
VALUES
(5, 'Arjun', 75),
(6, 'Shashank', 99),
(7, 'Sudheer', 97)

SELECT * FROM studentAnualReport

DROP TABLE studentAnualReport

Create table studentAnualReport
(
	RollNo int,
	StudentNames Varchar (100),
	Marks Float,
	Email Varchar (100),
	Mobile Varchar (20)

)

INSERT INTO studentAnualReport Values
(1, 'Thirumal', 99, 'Thirumal26@gmail.com', 9880891828),
(2, 'Kushi', 100, 'Kushi26@gmail.com', 9535014930),
(3, 'Naveen', 87, 'Naveenkumar82@gmail.com', 8971329833),
(4, 'Srujan', 84, 'SrujanNaik56@gmail.com', 9242157618)

SELECT * FROM studentAnualReport

update studentAnualReport
SET Mobile = 8971329842
where StudentNames = 'Naveen'

SELECT * FROM studentAnualReport

UPDATE studentAnualReport
SET Mobile = 7349662016,
    Email = 'Srujan92@gmail.com'
WHERE RollNo = 4 AND StudentNames = 'Srujan';

SELECT * FROM studentAnualReport



update studentAnualReport
SET Marks = 100
where StudentNames = 'Kushi'

SELECT * FROM studentAnualReport

SELECT StudentNames, Mobile, Email FROM studentAnualReport

SELECT StudentNames, Mobile, Marks FROM studentAnualReport
where Marks in (SELECT MAX(Marks) FROM studentAnualReport)             # Nested querries

SELECT StudentNames, Mobile, Marks FROM studentAnualReport
where Marks in (SELECT Min(Marks) FROM studentAnualReport)

SELECT COUNT(*)FROM studentAnualReport

SELECT StudentNames FROM studentAnualReport